{
  "backend/AltSignup.mo": "Provides a simple signup handler that validates non-empty username/password and returns a success message without real authentication logic.",
  "backend/main.mo": "Implements reward tracking with time‑filtered queries, inventory calculation, and access‑controlled reward addition using a principal‑keyed history map.",
  "feature_evidence.json": "Lists feature evidence metadata linking features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference or documentation.",
  "frontend/index.css": "Empty placeholder for global styles.",
  "frontend/index.html": "HTML entry point setting up fonts, II_URL configuration, and mounting the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Declares allowed alternative Internet Identity origins for the web app.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to index.html.",
  "frontend/src/App.tsx": "Sets up TanStack Router with RootLayout and all app routes including signup, login, onboarding, and dashboard pages.",
  "frontend/src/auth/iiConfig.ts": "Provides shared Internet Identity config and login options using environment-derived II URL and optional derivation origin.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Debug panel showing detailed authentication state, timing, platform info, and stall detection when debugAuth=1 is enabled.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Error panel displaying a message with optional retry and return-to-landing actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Help panel explaining blocked popup issues for Internet Identity and offering retry and direct II link options.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Status banner showing the current auth step, timing, outcomes, and suggested actions with retry and II link.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Banner indicating backend warmup status, including warming, ready, and failure states with retry support.",
  "frontend/src/components/auth/DisplayNamePromptDialog.tsx": "Dialog prompting the user to enter or skip setting a display name with validation and input handling.",
  "frontend/src/components/auth/IdentityConfirmationCard.tsx": "Card confirming the currently selected identity, showing display name and principal, with options to continue or switch identities.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handles II authorize callbacks only if user initiated auth, then redirects based on onboarding and Sweet Summit status.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Loads II config asynchronously and wraps children in InternetIdentityProvider with the resolved options.",
  "frontend/src/components/auth/PostAuthDisplayNameGate.tsx": "Prompts new authenticated users for a display name and routes them to onboarding after save or skip.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/AuthenticatedHeader.tsx": "Header component with logout and account deletion logic that clears identity, caches, onboarding data, and persisted session before redirecting home.",
  "frontend/src/components/RootLayout.tsx": "Root layout wrapping the app with onboarding result context and Internet Identity auth flow handlers.",
  "frontend/src/components/TaskModal.tsx": "Modal for managing a task timer with start, pause, resume, cancel, and completion handling, including countdown logic and UI state resets.",
  "frontend/src/config/ai.ts": "Deprecated AI config stub returning disabled settings; replaced by external proxy API.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Context for storing, hydrating, and persisting onboarding answers and AI results in localStorage.",
  "frontend/src/hooks/useActor.ts": "Builds an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Tracks user‑initiated auth attempts, timestamps, correlation IDs, and sets a session flag for callback handling.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Manages detailed auth‑flow state, steps, timings, and diagnostics logging, including slow‑step detection.",
  "frontend/src/hooks/useAuthPageAutoredirect.ts": "Auto‑redirects authenticated users off login/signup based on onboarding and Sweet Summit completion.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Manages a warmup ping to a canister actor with timeout handling, auto-start, and retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and provider for Internet Identity authentication, including login flow, state tracking, and identity restoration.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useLocalDisplayName.ts": "Manages per-principal display names and skip flags in localStorage with helpers to get, set, and clear values.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Implements a mobile-friendly Internet Identity login with preinitialized AuthClient and detailed outcome reporting.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "A patched mobile II login hook using shared configuration for AuthClient and login options with structured result handling.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Implements a context for password-based identities, restoring from storage and allowing set/clear operations.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Provides phase-based timeout tracking for post-auth steps with elapsed time and reset support.",
  "frontend/src/hooks/useQueries.ts": "Wraps React Query hooks for fetching, saving, and deleting the caller’s user profile using the canister actor.",
  "frontend/src/hooks/useRewards.ts": "Provides React Query hooks to fetch user reward inventory and add rewards, invalidating caches on updates.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Implements multi-step authentication stall detection with configurable timeouts and state tracking.",
  "frontend/src/index.css": "Defines global Tailwind styles and a chocolate-themed color system for the app UI.",
  "frontend/src/lib/aiClient.ts": "Legacy file that throws an error to prevent usage; AI requests must use aiProxyClient instead.",
  "frontend/src/lib/aiProxyClient.ts": "Implements type-safe external AI proxy calls with validation and detailed error handling for onboarding-related responses.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides helpers for safely storing and parsing onboarding JSON data in local storage.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/Daily.tsx": "Displays daily AI-generated tasks, handles task completion rewards, and manages loading and error states.",
  "frontend/src/pages/Fridge.tsx": "Shows the user’s chocolate reward inventory with time-range filtering and handles loading and errors.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero content, feature carousel modal, and buttons for signup/login, including automatic canister warmup.",
  "frontend/src/pages/Login.tsx": "Complex Internet Identity login flow with validation, diagnostics, stalled-state detection, and redirects based on user profile.",
  "frontend/src/pages/Onboarding.tsx": "Three‑step onboarding form that generates an AI-based plan, saves the profile, and redirects users based on onboarding status.",
  "frontend/src/pages/Signup.tsx": "Internet Identity signup flow with diagnostics, mobile compatibility, canister warmup, and redirect logic for existing profiles.",
  "frontend/src/pages/SignupTest.tsx": "Simple backup signup page that triggers Internet Identity login and redirects to onboarding after authentication.",
  "frontend/src/pages/SweetSummit.tsx": "Post-onboarding summary screen showing AI-generated goal, weekly mountain, and daily step, with a carousel and redirect to weekly mountain.",
  "frontend/src/pages/WeeklyMountain.tsx": "Fetches and caches the user's weekly mountain plan based on onboarding data, with fallback to stored values and retry handling.",
  "frontend/src/utils/authDiagnostics.ts": "Provides utilities for correlated auth logging, timing, and step transitions for debugging authentication flows.",
  "frontend/src/utils/identityValidation.ts": "Validates identities and detects stale sessions by checking anonymity and delegation validity.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from credentials and manages storing, restoring, and clearing them in localStorage.",
  "frontend/src/utils/platform.ts": "Detects Chrome on Android and exposes cached platform info for mobile-specific behavior.",
  "frontend/src/utils/safeRender.ts": "Safely converts AI-provided values to strings and extracts validated text to prevent render errors.",
  "frontend/src/utils/sessionFlags.ts": "Manages session-scoped flags like new-account flow indicators using sessionStorage.",
  "frontend/src/utils/sessionReset.ts": "Clears all SweetSteps-related persisted state from localStorage for logout or account reset.",
  "frontend/src/utils/urlParams.ts": "Reads, persists, and clears URL parameters across query strings and hash routing with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend styling system.",
  "project_state.json": "Project-wide state describing authentication and onboarding flow, routing rules, Sweet Summit carousel gating, and chocolate reward persistence. Includes architectural notes, known issues, and existing feature definitions for navigation and UX behaviors."
}