{
  "backend/main.mo": "Motoko canister that sets up authorization and manages user onboarding state, allowing authenticated users to complete onboarding and query whether they can still access it.",
  "feature_evidence.json": "Machine-readable feature evidence report describing three Daily SweetSteps UI features, their affected files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Aggregated human-written summaries of key frontend files, providing a high-level overview of routing, pages, styles, onboarding flow, and AI integration.",
  "frontend/index.css": "Global stylesheet entry point intended to define application-wide styles and theme tokens (content currently empty in this snapshot).",
  "frontend/index.html": "HTML entry point that loads fonts, configures the Internet Identity URL via environment variables, and boots the React application.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to index.html so the client-side router can handle deep links.",
  "frontend/src/App.tsx": "Main React application component that defines the TanStack Router route tree and wires all top-level pages under a root layout.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Optional diagnostics panel that displays Internet Identity configuration and current authentication state for debugging.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Reusable error display component that shows an authentication-related error message with optional retry and navigation actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Inline help component explaining Internet Identity popup behavior, offering retry guidance and a direct link to the II provider.",
  "frontend/src/components/RootLayout.tsx": "Root layout component that wraps all routes with the OnboardingResultProvider and renders the active route outlet.",
  "frontend/src/components/TaskModal.tsx": "Interactive modal component for completing a task with a configurable timer, including start/pause/resume logic and completion callbacks.",
  "frontend/src/config/ai.ts": "Utility that reads AI endpoint URL and API key from environment variables and reports whether AI integration is configured.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Defines a React context and provider to store and update onboarding answers and the corresponding AI-generated plan result across the app.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, handling authenticated vs anonymous access and invalidating dependent queries on change.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Provides utilities to manage a user-initiated authentication attempt, including a re-entrancy guard, active-attempt flag, and timestamp tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication using Dfinity AuthClient, exposing identity state, login/logout methods, and detailed login status via a React context provider.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalled authentication attempts by starting a timeout after a login attempt and signals when to show user help if login does not progress.",
  "frontend/src/index.css": "Centralized global Tailwind CSS file defining base styles, typography, and a chocolate-themed OKLCH color system used across the application.",
  "frontend/src/lib/aiClient.ts": "Client utility that calls an external AI chat completion API to generate a structured onboarding plan, with strict JSON validation and error handling.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Generates local placeholder onboarding plan data based on user inputs, used as a temporary stand-in before real AI or backend integration.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/Daily.tsx": "Daily tasks page that renders a list of placeholder \"SweetSteps,\" displays today’s date, and opens a modal to view or complete a selected task.",
  "frontend/src/pages/Fridge.tsx": "Renders a dashboard-style page showing chocolate inventory counts (tiny, bars, slabs) with toggle buttons for week, month, and all-time views using hardcoded data.",
  "frontend/src/pages/Landing.tsx": "Implements the public landing page with a hero section, navigation to signup/login, and a modal feature carousel explaining the product's core concepts.",
  "frontend/src/pages/Login.tsx": "Handles user login via Internet Identity, managing authentication phases, validation, error handling, and redirecting users based on onboarding completion.",
  "frontend/src/pages/Onboarding.tsx": "Provides a multi-step onboarding flow to collect user goals, generate a placeholder plan, mark onboarding complete in the backend, and transition users to the main app.",
  "frontend/src/pages/Signup.tsx": "Manages new user signup via Internet Identity with guarded auth attempts, identity validation, error handling, and automatic redirect to onboarding after success.",
  "frontend/src/pages/SweetSummit.tsx": "React page that displays a personalized post-onboarding plan using data from OnboardingResultContext, including a big goal and a sample weekly plan. Handles a missing onboarding state by showing an alert and redirect button back to onboarding.",
  "frontend/src/pages/WeeklyMountain.tsx": "React page for a weekly progress dashboard using placeholder data, showing completion percentage, stats, navigation actions, and a coach’s note. Serves as a scaffold for a future data-driven weekly goal view.",
  "frontend/src/utils/identityValidation.ts": "Utility functions to validate ICP identities by checking anonymity and delegation validity, and to detect stale authentication sessions. Used to determine whether a user must re-authenticate.",
  "frontend/src/utils/urlParams.ts": "Helper utilities for reading URL parameters from query strings or hash routes, persisting them in sessionStorage, and clearing them when needed. Supports token persistence and cleanup without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining design tokens, fonts, OKLCH-based color system, animations, and layout settings. Integrates typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the overall SweetSteps project, describing architecture, tech stack, and implemented backend and frontend features with versioned identifiers. Used for planning, tracking, and contextual awareness of system state."
}