{
  "backend/AltSignup.mo": "Simple signup handler with basic empty-field validation and simulated success response.",
  "backend/main.mo": "Actor managing user profiles with access control checks for saving, retrieving, and deleting caller data.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend source files for reference in build planning.",
  "frontend/index.css": "Global stylesheet; currently empty in this snapshot.",
  "frontend/index.html": "App entry HTML setting fonts and initializing II_URL before loading the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Declares alternative origins allowed for Internet Identity derivation.",
  "frontend/public/404.html": "SPA redirect page that forwards unknown routes to index.html.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and route definitions for all main pages including signup-test.",
  "frontend/src/auth/iiConfig.ts": "Shared Internet Identity auth configuration providing client creation and login options with derivation origin and II URL handling.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Debug panel displaying detailed authentication status, timing info, platform data, and stall detection.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Error UI showing a message with optional retry and return-to-landing actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Help panel explaining popup-blocking issues for Internet Identity with retry and direct-link options.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Status banner showing current auth step, timing, terminal outcomes, and retry or direct II actions.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Banner indicating backend warmup status with warming, ready, or failure states and retry support.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handler for II authorize callbacks that routes users based on onboarding status and session flags.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Wrapper loading II config before rendering InternetIdentityProvider with safe options.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/AuthenticatedHeader.tsx": "Header for authenticated pages with logout and account deletion logic tied to II, backend, and local state resets.",
  "frontend/src/components/RootLayout.tsx": "Root layout wrapping the app in onboarding context and II authorization callback handler.",
  "frontend/src/components/TaskModal.tsx": "Modal showing a task with a configurable timer, supporting start/pause/resume and completion callbacks.",
  "frontend/src/config/ai.ts": "Deprecated AI config returning empty defaults and warning users to use the proxy client.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "React context storing onboarding answers and AI results, persisted to localStorage with hydration and clear helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Tracks user-initiated auth attempts with timestamps, correlation IDs, and sessionStorage flags to manage flow state.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Provides detailed step-by-step auth flow tracking with timing, correlation IDs, slow-step detection, and logging.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Stub warmup hook that marks canister as ready when the actor is available, with optional auto-start and retry.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity auth, managing identity loading, login, logout, and status flags.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty file.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Mobile-safe II login hook that pre-initializes AuthClient and returns structured success/error outcomes.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Provides a mobile-safe Internet Identity login hook that pre-initializes AuthClient and handles popup, cancellation, and gesture preservation issues.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Implements a React context/provider for password-based identities with localStorage persistence and login/logout helpers.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Adds timeout tracking for post-authentication phases, exposing elapsed time, timeout state, and reset controls.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, saving, and deleting the caller's user profile via the backend actor.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalled authentication steps by timing phases and reporting stalled step, reason, and elapsed time.",
  "frontend/src/index.css": "Defines global Tailwind base styles and a chocolate-themed design system using OKLCH variables.",
  "frontend/src/lib/aiClient.ts": "Legacy unused AI client that throws an error if called.",
  "frontend/src/lib/aiProxyClient.ts": "Implements the AI proxy client with request types, validation, error handling, and parsing helpers for AI responses.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides storage helpers for onboarding data, including safe JSON parse and stringify functions.",
  "frontend/src/main.tsx": "Entry point that creates the React root and wraps App with React Query and Internet Identity providers.",
  "frontend/src/pages/Daily.tsx": "Daily tasks page that loads AI‑generated tasks based on onboarding data and displays loading, error, or task views with a modal.",
  "frontend/src/pages/Fridge.tsx": "Fridge page showing hardcoded chocolate inventory totals with period toggles and header/footer layout.",
  "frontend/src/pages/Landing.tsx": "Landing page with marketing hero section, feature carousel modal, and navigation buttons for signup and login.",
  "frontend/src/pages/Login.tsx": "Complex Internet Identity login flow handling validation, diagnostics, mobile fixes, timeouts, and post‑auth routing.",
  "frontend/src/pages/Onboarding.tsx": "Multi‑step onboarding form that gathers user goals, calls AI to generate a plan, saves the profile, and manages authenticated navigation.",
  "frontend/src/pages/Signup.tsx": "Signup page handling complex Internet Identity authentication flow with diagnostics, timeouts, mobile handling, and validation steps.",
  "frontend/src/pages/SignupTest.tsx": "Simplified backup signup page that triggers Internet Identity login and redirects to onboarding when authenticated.",
  "frontend/src/pages/SweetSummit.tsx": "Displays the user’s personalized AI-generated plan after onboarding, with sections for goals and navigation controls.",
  "frontend/src/pages/WeeklyMountain.tsx": "Fetches or loads cached weekly mountain goals based on onboarding results, handling loading, errors, and week-based caching.",
  "frontend/src/utils/authDiagnostics.ts": "Utility for structured auth flow logging, step timing, and correlated diagnostics.",
  "frontend/src/utils/identityValidation.ts": "Helpers to validate identities and detect stale sessions based on delegation and anonymity checks.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from credentials and manages storing, restoring, and clearing them in localStorage.",
  "frontend/src/utils/platform.ts": "Detects platform details, especially Chrome on Android, and caches results for performance.",
  "frontend/src/utils/safeRender.ts": "Provides helpers to safely convert unknown AI-returned values into strings and extract validated string fields without crashing React.",
  "frontend/src/utils/sessionReset.ts": "Clears all SweetSteps-related localStorage keys to reset client-side session state.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and removing them when needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins used by the frontend.",
  "project_state.json": "Describes current project state and requirements, focusing on fixing Internet Identity signup/login flows and related auth issues."
}