{
  "backend/AltSignup.mo": "Simple signup handler that validates non-empty username and password and returns a simulated success response.",
  "backend/main.mo": "Actor managing a reward system with time‑filtered reward history, inventory calculation, and access-controlled add/view operations.",
  "feature_evidence.json": "Feature evidence report listing two UI styling and icon-removal changes for Landing.tsx with associated components and test IDs.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries for various frontend files.",
  "frontend/index.css": "Empty stylesheet placeholder with no content.",
  "frontend/index.html": "HTML entry point that loads fonts, sets II_URL env var, and mounts the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Configuration specifying allowed alternative origins for Internet Identity derivation.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to index.html for client-side routing.",
  "frontend/src/App.tsx": "Router setup defining root layout and multiple routes, including redirecting /login to /signup.",
  "frontend/src/auth/iiConfig.ts": "Shared Internet Identity config helpers providing AuthClient creation and login options using environment-derived settings.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Debug-only panel showing detailed auth state, timing, platform info, and stall detection.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Displays an error message with optional Retry and Return-to-Landing actions.",
  "frontend/src/components/auth/AuthInitializationGate.tsx": "Blocks app rendering until auth initializes or times out, handling stale sessions and retry flow.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Explains blocked popup issues for Internet Identity and provides retry and direct II link options.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Shows real-time auth progress, timing, outcomes, and suggested actions with retry and II link.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Banner indicating backend warmup status with warming, ready, and failure states plus retry.",
  "frontend/src/components/auth/DisplayNamePromptDialog.tsx": "Modal dialog letting users enter or skip setting a display name with validation and save/skip actions.",
  "frontend/src/components/auth/IdentityConfirmationCard.tsx": "Card showing a principal’s display name and truncated ID with actions to continue or switch identity.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Effect handler that processes II authorize callbacks, validates session state, checks onboarding, and routes accordingly.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Wrapper that loads II config asynchronously before rendering the InternetIdentityProvider.",
  "frontend/src/components/auth/PostAuthDisplayNameGate.tsx": "Gate that prompts new authenticated users to set or skip a display name before navigating to onboarding.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/AuthenticatedHeader.tsx": "Header component for authenticated pages with logout, account deletion, and menu interactions.",
  "frontend/src/components/RootLayout.tsx": "Root layout wrapping onboarding, auth initialization, and callback handlers around routed pages.",
  "frontend/src/components/TaskModal.tsx": "Modal for running a task timer with start/pause/resume logic, completion handling, and time selection.",
  "frontend/src/config/ai.ts": "Deprecated AI config returning disabled settings with a warning to use the proxy client.",
  "frontend/src/config/authInitializationGateConfig.ts": "Config object defining timeout and messages for the auth initialization gate.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Context that stores, hydrates, and persists onboarding results in localStorage.",
  "frontend/src/hooks/useActor.ts": "Hook that creates an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Hook managing user-initiated auth attempts with timestamps, correlation IDs, and sessionStorage tracking.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Tracks authentication steps with timing, logs transitions, detects slow steps, and records final outcomes.",
  "frontend/src/hooks/useAuthPageAutoredirect.ts": "Auto-redirects authenticated users from login/signup pages based on identity, actor readiness, and profile/onboarding state.",
  "frontend/src/hooks/useAuthStabilization.ts": "Stabilizes auth state by waiting for Internet Identity initialization and identity restoration before declaring authenticated or not.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Warms up a canister by calling ping with timeout handling, tracking warmup state, auto-start, and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity loading, and status management through AuthClient.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty file.",
  "frontend/src/hooks/useLocalDisplayName.ts": "Manages per‑principal display names and skip flags in localStorage with get, set, and clear functions.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Implements mobile‑safe Internet Identity login with pre‑initialized AuthClient and structured outcome reporting.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Provides a mobile-safe Internet Identity login hook that pre-initializes AuthClient and handles popup, cancellation, and identity retrieval errors.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Implements a context/provider for password-based identities with storage restoration, persistence, and logout handling.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Manages timeouts for post-authentication phases, tracking elapsed time and triggering callbacks when limits are reached.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor queries and mutations for user profiles and rewards with React Query, including cache invalidation.",
  "frontend/src/hooks/useRewards.ts": "Provides React Query hooks for fetching and adding caller rewards with automatic cache refresh.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalled authentication steps by tracking elapsed time, step-specific timeouts, and status transitions.",
  "frontend/src/index.css": "Defines global Tailwind layers and OKLCH-based chocolate-themed design tokens for colors, typography, and layout.",
  "frontend/src/lib/aiClient.ts": "Legacy placeholder that disables old AI client usage in favor of aiProxyClient.",
  "frontend/src/lib/aiProxyClient.ts": "Defines types, error handling, and validation helpers for calling AI proxy endpoints and parsing onboarding, weekly mountain, and daily steps responses.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides storage key and safe JSON parse/stringify helpers for persisting onboarding results.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Daily.tsx": "Fetches and displays daily tasks using AI-generated steps, handling auth, profile data, errors, and task completion rewards.",
  "frontend/src/pages/Fridge.tsx": "Shows the user’s earned chocolate rewards with time‑range filters and handles loading and error states.",
  "frontend/src/pages/Landing.tsx": "Landing page with feature carousel and Internet Identity login flow including warmup, auth stabilization, and post-login routing.",
  "frontend/src/pages/Login.tsx": "Empty login page placeholder.",
  "frontend/src/pages/Onboarding.tsx": "Manages the multi‑step onboarding flow, generating AI plans, saving profiles, and routing based on auth and prior completion.",
  "frontend/src/pages/Signup.tsx": "Complex Internet Identity signup flow with diagnostics, stalled-auth detection, mobile login handling, and multi-phase state management.",
  "frontend/src/pages/SignupTest.tsx": "Simplified backup signup page that triggers II login and redirects to onboarding when authenticated.",
  "frontend/src/pages/SweetSummit.tsx": "Displays a post-onboarding carousel summarizing the user’s AI-generated goals and redirects to Weekly Mountain when finished.",
  "frontend/src/pages/WeeklyMountain.tsx": "Generates or loads the user’s weekly mountain goal using onboarding data or backend profile and caches results per week.",
  "frontend/src/utils/authDiagnostics.ts": "Provides logging utilities for correlating and timing authentication steps, transitions, and outcomes.",
  "frontend/src/utils/dailyInputs.ts": "Derives daily AI generation inputs from onboarding data or backend goal plus cached weekly mountain.",
  "frontend/src/utils/identityValidation.ts": "Validates identities and detects stale sessions based on delegation and anonymity checks.",
  "frontend/src/utils/iiReturnDetection.ts": "Detects signs of returning from an Internet Identity authentication flow via URL hash or session flags.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from username/password and stores, restores, or clears them in localStorage.",
  "frontend/src/utils/platform.ts": "Detects Chrome on Android and exposes cached platform info for conditional UI behavior.",
  "frontend/src/utils/safeRender.ts": "Safely converts unknown AI-provided values to strings and provides validation and fallback helpers for rendering.",
  "frontend/src/utils/sessionFlags.ts": "Manages a session-scoped flag indicating new-account signup flow using sessionStorage.",
  "frontend/src/utils/sessionReset.ts": "Clears all SweetSteps-related persisted localStorage state on logout or account deletion.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters, including hash-based routes and session storage integration.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata describing current features, pending requests, and state versioning."
}