{
  "backend/AltSignup.mo": "Test signup handler with basic empty-field validation and simulated success response.",
  "backend/main.mo": "Actor managing user profiles with authorization checks for saving, viewing, and deleting caller data.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files used as reference for build planning.",
  "frontend/index.css": "Empty stylesheet file.",
  "frontend/index.html": "HTML entry point setting fonts and configuring II_URL before loading the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Lists alternative Internet Identity derivation origins for the app.",
  "frontend/public/404.html": "SPA redirect page that routes unknown paths to index.html.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration and all application routes.",
  "frontend/src/auth/iiConfig.ts": "Shared Internet Identity config utilities for AuthClient creation and login options.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Displays detailed debug authentication state, timing, platform info, and stall detection when debugAuth=1 is enabled.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Shows an error message with optional Retry and Return-to-Landing actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Provides popup-blocking help for Internet Identity with retry and direct II link options.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Persistent banner showing auth step, timing, outcome, and suggested actions including retry and II link.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Displays backend warmup status with states for warming, ready, and failed, plus retry handling.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handles II authorize callbacks and routes users based on onboarding completion.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Loads II config asynchronously and wraps children in a configured InternetIdentityProvider.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/AuthenticatedHeader.tsx": "Header with logout and delete-account actions clearing identity, caches, and local state.",
  "frontend/src/components/RootLayout.tsx": "Root layout wrapping the app with onboarding context and II authorization callback handler.",
  "frontend/src/components/TaskModal.tsx": "Task modal with adjustable timer, completion handling, and cleanup logic on close.",
  "frontend/src/config/ai.ts": "Deprecated AI config returning placeholder values and warning to use the proxy client instead.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Provides context for storing, loading, and clearing onboarding results persisted in localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity, initializes access control, and invalidates dependent queries on change.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Manages auth attempt state with re‑entrancy prevention, timestamps, correlation IDs, and reset helpers.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Tracks auth flow steps, timings, slow-step detection, and logs transitions and outcomes for diagnostics.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Provides a simple canister warmup hook that immediately marks readiness and supports optional auto-start and retry.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity login, identity restoration, and status tracking using AuthClient.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Implements mobile-safe Internet Identity login with preinitialized AuthClient and structured outcome reporting.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Patched mobile II login using shared config, preinitialized AuthClient, and structured error handling.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Manages username/password-based identity with storage persistence and a React context provider.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Hook that manages timeouts for post-authentication phases, tracking elapsed time and exposing reset logic.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalled authentication steps using configurable timeouts and reports stalled state and reasons.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, typography, and utility styles.",
  "frontend/src/lib/aiClient.ts": "Legacy AI client that is disabled and throws an error if used.",
  "frontend/src/lib/aiProxyClient.ts": "AI proxy client defining request/response types, validation helpers, and error handling for external AI calls.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Utilities for storing onboarding data with safe JSON parse and stringify helpers.",
  "frontend/src/main.tsx": "Application entry point that initializes React, query client, and Internet Identity provider.",
  "frontend/src/pages/Daily.tsx": "Daily tasks page that fetches AI‑generated daily steps, handles loading and errors, and displays task details.",
  "frontend/src/pages/Fridge.tsx": "Displays hardcoded chocolate inventory across time periods with UI controls to switch views.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, feature carousel, and navigation buttons for signup/login.",
  "frontend/src/pages/Login.tsx": "Complex Internet Identity login flow with validation, diagnostics, timeouts, and redirect handling.",
  "frontend/src/pages/Onboarding.tsx": "Multi‑step onboarding form that gathers user goals, calls an AI plan generator, and stores results.",
  "frontend/src/pages/Signup.tsx": "Signup page using Internet Identity with validation, diagnostics, timeout handling, and redirects.",
  "frontend/src/pages/SignupTest.tsx": "Simplified backup signup page for testing Internet Identity authentication and redirecting to onboarding.",
  "frontend/src/pages/SweetSummit.tsx": "Displays the user’s personalized AI‑generated plan with sections for goals and weekly targets.",
  "frontend/src/pages/WeeklyMountain.tsx": "Fetches, caches, and displays the user's weekly mountain plan using onboarding data, with retry and restart handling.",
  "frontend/src/utils/authDiagnostics.ts": "Provides utilities for correlated auth logging, step tracking, and timing diagnostics.",
  "frontend/src/utils/identityValidation.ts": "Validates identities and determines whether a session is stale based on delegation and anonymity checks.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from credentials and handles storing, restoring, and clearing them.",
  "frontend/src/utils/platform.ts": "Detects Chrome on Android and caches platform info for mobile-specific behavior.",
  "frontend/src/utils/safeRender.ts": "Safely converts AI-provided values into displayable strings and provides helpers for validating and extracting string fields.",
  "frontend/src/utils/sessionReset.ts": "Clears all SweetSteps client-side state including onboarding results and weekly mountain cache.",
  "frontend/src/utils/urlParams.ts": "Parses URL parameters, syncs them with sessionStorage, and supports removing values from hash-based URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugin integrations.",
  "project_state.json": "Defines the SweetSteps project state, including existing and requested features for Logout and Delete Account flows tied to Internet Identity. Contains metadata, architectural notes, and pending feature requests for backend and in‑app actions."
}