{
  "backend/AltSignup.mo": "Provides a simple signup handler that validates non‑empty credentials and returns a simulated success response.",
  "backend/main.mo": "Primary backend actor implementing RBAC, user profile storage, onboarding flow management, and an alternate signup entrypoint.",
  "backend/migration.mo": "Defines migration types for actor state and currently returns the state unchanged.",
  "feature_evidence.json": "Contains feature evidence metadata describing removal of the temporary SignupTest button from the landing page.",
  "frontend-file-summaries.txt": "Lists pre‑generated summaries for numerous frontend files including pages, config, and components.",
  "frontend/index.css": "Empty stylesheet placeholder with no content.",
  "frontend/index.html": "HTML entry point that loads fonts, sets II_URL environment config, and mounts the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Declares allowed alternative origins for Internet Identity.",
  "frontend/public/404.html": "SPA fallback page that redirects all unknown routes to index.html.",
  "frontend/src/App.tsx": "Configures TanStack Router with the root layout and all application routes including /signup-test.",
  "frontend/src/auth/iiConfig.ts": "Provides shared Internet Identity configuration for AuthClient creation and login options.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Debug panel showing detailed authentication state, timing, platform info, and stall detection used when debugAuth=1.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Reusable error display with a message and optional Retry and Return-to-Landing actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Help panel explaining blocked popup issues and giving retry and direct II link options.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Status banner showing current auth step, timing, outcomes, and suggested retry or II link actions.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Banner indicating backend warmup, success, or failure with retry support.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handles II #authorize callback, checks onboarding status, and routes to onboarding or main app.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Loads II config then wraps children in a configured InternetIdentityProvider.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/RootLayout.tsx": "Wraps the app in onboarding context and handles II authorization callbacks before rendering child routes.",
  "frontend/src/components/TaskModal.tsx": "Modal component for task execution with a countdown timer, pause/resume controls, and completion handling.",
  "frontend/src/config/ai.ts": "Deprecated AI config returning empty values and warning to use aiProxyClient instead.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Context managing onboarding results with localStorage hydration, persistence, and clearing.",
  "frontend/src/hooks/useActor.ts": "Creates and caches backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Hook managing auth attempt lifecycle including timestamps, correlation IDs, and reset logic.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Tracks auth flow state, timing, step transitions, and slow-step detection with logging utilities.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Manages asynchronous canister warmup with timeout handling, retries, and state guards to prevent concurrent calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, managing AuthClient initialization, login state, and stored identities.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty file.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Mobile-friendly Internet Identity login hook that pre-initializes AuthClient and returns structured login outcomes.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Variant of the mobile login hook using shared II config for AuthClient initialization and login options.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Implements a provider and hook for username/password-based identities with storage-backed persistence and lifecycle management.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "React hook that manages timeout tracking for post-auth phases, exposing timeout state, elapsed time, and reset logic.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalled authentication steps by tracking elapsed time and applying step-specific timeouts to flag slow or stuck login flows.",
  "frontend/src/index.css": "Global Tailwind-based stylesheet defining theme tokens, typography, and utility layers for the app.",
  "frontend/src/lib/aiClient.ts": "Deprecated AI client that throws an error if used, directing callers to the proxy-based client.",
  "frontend/src/lib/aiProxyClient.ts": "AI proxy client with request/response types and validation helpers, plus custom error handling for external AI API calls.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides storage key and safe JSON parse/stringify helpers for persisting onboarding results.",
  "frontend/src/main.tsx": "App entrypoint that mounts React, sets up QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/Daily.tsx": "Daily tasks page that loads AI‑generated tasks based on onboarding data, handles loading/error states, and displays task details.",
  "frontend/src/pages/Fridge.tsx": "UI page showing hardcoded chocolate inventory across time periods with toggleable views and styled cards.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, feature carousel modal, and navigation buttons for signup and login.",
  "frontend/src/pages/Login.tsx": "Complex Internet Identity login flow with diagnostics, timeout handling, actor initialization, and error states.",
  "frontend/src/pages/Onboarding.tsx": "Multi‑step onboarding form that validates access, collects goal data, calls an AI plan generator, and manages a summary carousel.",
  "frontend/src/pages/Signup.tsx": "Signup page implementing Internet Identity authentication with stateful flow control, diagnostics, and warmup handling.",
  "frontend/src/pages/SignupTest.tsx": "Lightweight alternate signup page that triggers Internet Identity login and redirects to onboarding on success.",
  "frontend/src/pages/SweetSummit.tsx": "Displays the AI‑generated onboarding plan with goal, weekly mountain, and navigation back to onboarding if missing data.",
  "frontend/src/pages/WeeklyMountain.tsx": "Fetches or restores the weekly mountain plan based on onboarding data, storing results in localStorage and handling loading, errors, and backend onboarding checks.",
  "frontend/src/utils/authDiagnostics.ts": "Provides utilities for correlated auth logging, step timing, readable labels, and diagnostics for slow or failed authentication flows.",
  "frontend/src/utils/identityValidation.ts": "Validates identities by checking anonymity and delegation validity, and determines whether a session is stale.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from credentials and manages storing, restoring, and clearing them in localStorage.",
  "frontend/src/utils/platform.ts": "Detects platform details, especially whether the browser is Chrome on Android, with cached lookup utilities.",
  "frontend/src/utils/safeRender.ts": "Safely converts AI-provided values into strings for rendering and offers helpers for validating and extracting string fields.",
  "frontend/src/utils/urlParams.ts": "Handles extracting, persisting, and clearing URL parameters across query strings and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom themes, colors, typography, animations, and plugin integrations.",
  "project_state.json": "Tracks the project’s schema version, feature list, and a detailed description of the dapp’s architecture across Motoko backend, React frontend, authentication, onboarding, RBAC, and AI-integration. Serves as a centralized snapshot of implemented features and their versions for build planning."
}