{
  "backend/AltSignup.mo": "Provides a simple signup handler that validates non-empty credentials and returns a simulated success response.",
  "backend/main.mo": "Implements reward tracking, inventory calculation, and user-authorization logic for a chocolate-themed reward system.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for various frontend source files used elsewhere in the project.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry point that loads fonts, configures the Internet Identity URL, and mounts the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Declares alternative origins allowed for Internet Identity derivation.",
  "frontend/public/404.html": "Redirects unknown routes to index.html so the SPA router can handle them.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with the root layout and all application routes.",
  "frontend/src/auth/iiConfig.ts": "Provides shared Internet Identity client and login configuration including provider URL and derivation origin.",
  "frontend/src/components/AccountActionsMenu.tsx": "Renders a hamburger menu with Logout and Delete Account actions, handling disabled and loading states.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Shows detailed Internet Identity auth diagnostics including status, timing, platform info, and stall detection.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Displays a user-friendly auth error with optional retry and return-to-landing actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Explains popup-blocking issues during Internet Identity login and provides retry and direct II link options.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Shows real-time auth flow progress, outcomes, timing, and suggested actions with retry and II link support.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Displays backend warmup states with loading, success, or failure messaging and optional retry.",
  "frontend/src/components/auth/DisplayNamePromptDialog.tsx": "Modal dialog prompting the user to set a display name with validation and skip/save options.",
  "frontend/src/components/auth/IdentityConfirmationCard.tsx": "Renders a card showing a principal's display name and ID with actions to continue or switch identities. Supports loading state and principal truncation.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handles Internet Identity authorize callbacks by checking session flags, loading the user profile, and routing users to onboarding or post-login pages. Runs automatically when the auth callback is detected.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Loads II configuration asynchronously and wraps children in an InternetIdentityProvider with safe createOptions. Renders nothing until config is ready.",
  "frontend/src/components/auth/PostAuthDisplayNameGate.tsx": "Prompts new authenticated users to set or skip a display name based on session flags and stored names. Navigates to onboarding after save or skip.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/AuthenticatedHeader.tsx": "Header component that displays title/subtitle and manages logout and delete-account flows using AccountActionsMenu.",
  "frontend/src/components/RootLayout.tsx": "Wraps the app with onboarding and auth handlers and renders the router outlet.",
  "frontend/src/components/TaskModal.tsx": "Provides a task-focused modal with a configurable countdown timer and completion controls.",
  "frontend/src/config/ai.ts": "Deprecated AI config stub returning disabled settings and warning to use the proxy client instead.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Stores, hydrates, and persists onboarding results in localStorage with a context provider. Exposes methods to set and clear the stored result.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor based on Internet Identity. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Tracks user‑initiated auth attempts with timestamps, correlation IDs, and session flags. Provides helpers to start, end, reset, and inspect an auth attempt.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Manages detailed auth-flow state, timing, step transitions, and slow-step detection for diagnostics. Provides functions to start attempts and record step transitions.",
  "frontend/src/hooks/useAuthPageAutoredirect.ts": "Automatically redirects authenticated users away from login/signup based on profile and Sweet Summit state.",
  "frontend/src/hooks/useAuthStabilization.ts": "Provides a stabilized auth signal by waiting for identity initialization and a short delay to avoid transient redirects.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Manages canister warmup by pinging the actor with timeout, tracking state, and offering retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling identity initialization, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty placeholder file for Internet Identity signup testing.",
  "frontend/src/hooks/useLocalDisplayName.ts": "Manages per-principal display names and skip flags in localStorage with getters, setters, and clear operations.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Mobile-safe II login hook that pre-initializes AuthClient and returns detailed structured login results.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Mobile-safe II login hook using shared configuration for consistent setup and structured outcome reporting.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Provides password-based identity context with storage-backed login, logout, and automatic restoration.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Hook that tracks timeouts for post-auth phases, reporting elapsed time and timeout status with reset support.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for fetching, saving, and deleting the caller’s user profile using react-query and an actor instance.",
  "frontend/src/hooks/useRewards.ts": "React-query hooks to fetch caller reward inventory and add rewards, with automatic cache invalidation.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalled authentication steps by timing phases and reporting stall state, reasons, and elapsed time.",
  "frontend/src/index.css": "Defines global Tailwind styles and a chocolate‑themed color system for the app UI.",
  "frontend/src/lib/aiClient.ts": "Legacy AI client stub that throws an error and should not be used.",
  "frontend/src/lib/aiProxyClient.ts": "Client for calling external AI proxy endpoints with validation, typed requests, and structured error handling.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides storage key and safe JSON helpers for persisting onboarding results.",
  "frontend/src/main.tsx": "App entry point initializing React, react-query, Internet Identity context, and global styles.",
  "frontend/src/pages/Daily.tsx": "Daily tasks page that loads AI-generated tasks, displays them with a modal, and awards rewards on completion.",
  "frontend/src/pages/Fridge.tsx": "Displays user chocolate rewards filtered by time range, handles loading and error states, and shows counts for different reward types.",
  "frontend/src/pages/Landing.tsx": "Public landing page with app intro, feature carousel, and navigation to signup or login.",
  "frontend/src/pages/Login.tsx": "Implements complex Internet Identity login flow with validation, diagnostics, mobile handling, and redirects based on profile state.",
  "frontend/src/pages/Onboarding.tsx": "Guides new authenticated users through a multi-step onboarding flow, saving profile data and redirecting based on prior completion.",
  "frontend/src/pages/Signup.tsx": "Handles Internet Identity signup with validation, stalled login detection, diagnostics, and redirects depending on existing user profile.",
  "frontend/src/pages/SignupTest.tsx": "Simple backup signup page that triggers Internet Identity login and redirects to onboarding on success.",
  "frontend/src/pages/SweetSummit.tsx": "React page showing a three‑slide onboarding summary and redirecting users to Weekly Mountain after marking Sweet Summit as seen.",
  "frontend/src/pages/WeeklyMountain.tsx": "Loads or generates the weekly mountain plan using onboarding data, caching results per week and handling loading and error states.",
  "frontend/src/utils/authDiagnostics.ts": "Provides structured logging, timing, and correlation utilities for tracking authentication steps and outcomes.",
  "frontend/src/utils/identityValidation.ts": "Validates identities and delegations to determine if a session is usable or stale.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from credentials and manages storing, restoring, and clearing them in localStorage.",
  "frontend/src/utils/platform.ts": "Detects Chrome on Android and caches platform info for mobile‑specific behavior.",
  "frontend/src/utils/safeRender.ts": "Safely converts unknown AI values into renderable strings and offers validation and fallback helpers.",
  "frontend/src/utils/sessionFlags.ts": "Manages session‑scoped flags for tracking new‑account flows via sessionStorage.",
  "frontend/src/utils/sessionReset.ts": "Clears all locally stored SweetSteps state including onboarding and weekly mountain caches.",
  "frontend/src/utils/urlParams.ts": "Parses URL parameters, persists them in sessionStorage, and manages cleanup of parameters from URL or session.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, custom colors, fonts, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot describing UI/UX layout fixes and a header hamburger-menu redesign, including existing and pending feature requests."
}