{
  "backend/main.mo": "Motoko canister that initializes an access-controlled authorization system and manages user onboarding state, allowing authenticated users to complete onboarding and query whether they still need onboarding.",
  "feature_evidence.json": "Machine-readable report describing a high-confidence feature implementation for a TaskModal React component, including related files, dependencies, and test requirement IDs.",
  "frontend-file-summaries.txt": "Aggregated JSON-style document summarizing the purpose of major frontend files, routes, pages, styles, configuration, and onboarding/AI-related modules.",
  "frontend/index.css": "Global stylesheet entry point intended to define application-wide styles and theme tokens, currently empty in this file snapshot.",
  "frontend/index.html": "HTML entry point that loads Google Fonts, configures the Internet Identity URL via injected environment variables, and mounts the React application.",
  "frontend/public/404.html": "SPA fallback page that redirects all 404 responses to index.html so client-side routing can handle deep links correctly.",
  "frontend/src/App.tsx": "Main React application component that defines the TanStack Router route tree and wires up all primary pages and routes.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Optional diagnostics panel that displays Internet Identity configuration details and current authentication state for debugging.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Reusable error alert component that shows authentication-related errors and provides retry and return-to-landing actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Inline help panel explaining Internet Identity popup behavior, offering retry guidance and a direct link to the identity provider.",
  "frontend/src/components/RootLayout.tsx": "Root layout wrapper that renders the active route outlet inside the OnboardingResultProvider for shared onboarding state.",
  "frontend/src/components/TaskModal.tsx": "Self-contained React modal component that displays a task with an adjustable countdown timer, start/pause/cancel controls, and a completion confirmation callback flow.",
  "frontend/src/config/ai.ts": "Utility that reads AI endpoint and API key from Vite environment variables and reports whether AI integration is configured.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "React context and provider that store onboarding answers and AI-generated results in memory for sharing across onboarding-related pages.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor using React Query, switching between anonymous and authenticated actors based on Internet Identity. It reinitializes access control with an admin token and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Hook that manages a user-initiated authentication attempt lifecycle, preventing re-entrancy and tracking an attempt timestamp. Exposes flags and helpers to start, end, and inspect an auth attempt.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity authentication, including login, logout, identity persistence, and detailed login status flags. Wraps the app with an AuthClient-backed provider that loads stored identities and handles delegation validity.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Hook that detects stalled authentication attempts by starting a timeout after a user action and exposing a boolean to show help if login does not reach a terminal state. Resets automatically when identity or error/success status appears.",
  "frontend/src/index.css": "Global Tailwind CSS entry defining the single source of truth for styles, including OKLCH color tokens, dark chocolate theme variables, typography, and base layout rules. Also includes utility helpers like scrollbar hiding.",
  "frontend/src/lib/aiClient.ts": "Client utility that calls an external AI chat completion API to generate onboarding goal plans, enforcing strict JSON-only responses. Handles request construction, error handling, JSON parsing, and response shape validation.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Local utility that generates deterministic placeholder onboarding plan data based on user inputs without making network calls. Used as a temporary stand-in before real AI or API integration.",
  "frontend/src/main.tsx": "Frontend entry point that mounts the React app, wiring up React Query and the Internet Identity provider. Imports global styles and renders the root App component.",
  "frontend/src/pages/Daily.tsx": "Daily SweetSteps page that renders a styled list of daily tasks with time estimates using placeholder data. Provides a complete layout with header, card-based main content, and footer.",
  "frontend/src/pages/Fridge.tsx": "Renders a \"Chocolate Fridge\" dashboard showing counts of tiny chocolates, bars, and slabs with toggle buttons for week, month, and all-time periods using hardcoded data.",
  "frontend/src/pages/Landing.tsx": "Implements the marketing landing page with a hero section, navigation to signup/login, and a modal carousel highlighting core product features with keyboard navigation.",
  "frontend/src/pages/Login.tsx": "Handles user login via Internet Identity with detailed auth state management, validation, stalled-attempt detection, and redirects based on onboarding completion.",
  "frontend/src/pages/Onboarding.tsx": "Implements a multi-step onboarding flow that collects goal inputs, checks backend access, generates a placeholder plan, marks onboarding complete, and redirects authenticated users.",
  "frontend/src/pages/Signup.tsx": "Manages user signup using Internet Identity with guarded auth attempts, identity validation, error handling, and automatic redirection to onboarding after successful authentication.",
  "frontend/src/pages/SweetSummit.tsx": "React page that displays a personalized post-onboarding summary using onboarding context data, including a big goal and a sample weekly plan. Handles an empty state by prompting users to complete onboarding and navigate back to the onboarding flow.",
  "frontend/src/pages/WeeklyMountain.tsx": "React page showing a placeholder weekly dashboard with progress metrics, action buttons to daily tasks and rewards, and a coach’s note. Uses static placeholder data and basic navigation to other app sections.",
  "frontend/src/utils/identityValidation.ts": "Utility functions to validate ICP identities for authenticated use, checking for non-anonymous principals and valid delegations. Also provides a helper to detect stale or invalid sessions.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash-based routing and persisting them in sessionStorage. Includes helpers to retrieve, store, clear, and sanitize parameters for session-wide use.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme tokens, fonts, OKLCH-based color system, animations, and layout defaults. Integrates typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the SweetSteps project, describing architecture, frontend and backend features, and versioned existing functionality. Serves as a canonical summary of current capabilities and system state."
}