{
  "backend/AltSignup.mo": "Provides a simple signup handler with basic empty-field validation and a simulated success response.",
  "backend/main.mo": "Main actor offering user profile storage with access control checks for saving and retrieving profiles.",
  "feature_evidence.json": "Defines a feature evidence report describing a UI fix in Landing.tsx and its related components and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Empty stylesheet placeholder for global CSS rules.",
  "frontend/index.html": "HTML entry point setting up fonts and configuring II_URL before loading the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Specifies alternative origins allowed for Internet Identity derivation.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to index.html for client-side routing.",
  "frontend/src/App.tsx": "Configures the TanStack Router with the root layout and all application routes.",
  "frontend/src/auth/iiConfig.ts": "Provides shared Internet Identity client and login configuration using environment-derived settings.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Debug panel showing Internet Identity state, timing, and stall detection when enabled.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Reusable error panel with retry and navigation actions for authentication-related failures.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Inline help panel explaining blocked II popups with retry and direct-link actions.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Status banner showing auth step progress, timing, outcomes, and retry/direct-link options.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Banner indicating backend warmup, success, or failure with optional retry.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Detects II authorize callback and redirects based on onboarding status.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Loads II config then wraps children in a configured InternetIdentityProvider.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/RootLayout.tsx": "Wraps all pages with onboarding context and the Internet Identity authorize callback handler.",
  "frontend/src/components/TaskModal.tsx": "Task timer modal with adjustable duration, countdown logic, and completion controls.",
  "frontend/src/config/ai.ts": "Deprecated AI config stub returning empty inactive settings.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Context that loads, stores, and clears onboarding results in localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Manages lifecycle state for a user auth attempt with timing and correlation IDs.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Tracks detailed auth-flow steps, timings, slow-step detection, and outcomes for diagnostics.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Simplified warmup hook that immediately marks state as ready and supports optional auto-start and manual retry.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, clear, and status tracking, initializing AuthClient and restoring identities.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Mobile-focused II login hook that pre-initializes AuthClient and returns detailed login outcomes like blocked or cancelled.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Patched mobile II login hook using shared configuration for AuthClient and structured outcome reporting.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Context provider managing password‑based identities with storage restore, set, and clear helpers.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Manages per-phase post-authentication timeouts with elapsed tracking and reset control.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalled authentication steps using step-specific timeouts and reports stall state, timing, and reason.",
  "frontend/src/index.css": "Defines global Tailwind layers and OKLCH theme tokens for the app’s chocolate-themed design, including typography and utility classes.",
  "frontend/src/lib/aiClient.ts": "Legacy AI client that throws an error and should not be used.",
  "frontend/src/lib/aiProxyClient.ts": "Implements the AI proxy client with request/response types, validation, error handling, and helpers for onboarding and daily step generation.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides storage key plus safe JSON parse and stringify helpers for onboarding data persistence.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Daily.tsx": "Fetches and displays AI‑generated daily tasks with loading, error handling, and task modal interactions.",
  "frontend/src/pages/Fridge.tsx": "Shows hardcoded chocolate inventory stats with period switching (week, month, all time).",
  "frontend/src/pages/Landing.tsx": "Landing page with feature slides, modal navigation, and links to signup/login.",
  "frontend/src/pages/Login.tsx": "Implements the Internet Identity login flow with phased state handling, timeout guards, mobile fallbacks, diagnostics, and post-auth routing.",
  "frontend/src/pages/Onboarding.tsx": "Guides authenticated users through a multi-step onboarding form and generates a personalized plan via the AI proxy API, saving results to context.",
  "frontend/src/pages/Signup.tsx": "Handles user signup through Internet Identity with detailed auth-state phases, error handling, mobile login support, diagnostics, and post-auth redirects.",
  "frontend/src/pages/SignupTest.tsx": "A simplified backup signup page that triggers Internet Identity login and redirects to onboarding once identity and actor are ready.",
  "frontend/src/pages/SweetSummit.tsx": "Displays the user’s personalized AI-generated goal and weekly plan, or redirects them to onboarding if no results exist.",
  "frontend/src/pages/WeeklyMountain.tsx": "Generates or loads a cached weekly mountain plan based on onboarding results, with error handling, caching, and restart options.",
  "frontend/src/utils/authDiagnostics.ts": "Provides types and utilities for tracking auth steps, generating correlation IDs, and logging step transitions and outcomes.",
  "frontend/src/utils/identityValidation.ts": "Validates identities and detects stale sessions by checking anonymity and delegation validity.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from credentials and manages storing, restoring, and clearing them in localStorage.",
  "frontend/src/utils/platform.ts": "Detects Chrome on Android and caches platform info for mobile-specific auth behavior.",
  "frontend/src/utils/safeRender.ts": "Safely converts unknown AI values to strings and provides helpers for validating and extracting string fields.",
  "frontend/src/utils/urlParams.ts": "Handles URL and sessionStorage parameter retrieval, persistence, and cleanup for routing and state management.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the app’s styling system.",
  "project_state.json": "Describes current project state, known issues, and feature requests for the SweetSteps app."
}