{
  "backend/AltSignup.mo": "Simple signup handler performing basic username/password validation and returning a simulated success response.",
  "backend/main.mo": "Primary backend actor managing RBAC checks, user onboarding profiles, and an alternate signup method stub.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Existing summaries of multiple frontend files for reference or build planning.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point configuring Internet Identity URL and loading the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Defines allowed alternative origins for Internet Identity derivation.",
  "frontend/public/404.html": "SPA fallback page that redirects all unknown routes to index.html.",
  "frontend/src/App.tsx": "Sets up TanStack Router with RootLayout and all app routes including signup, login, onboarding, and test variants.",
  "frontend/src/auth/iiConfig.ts": "Shared Internet Identity configuration utilities providing AuthClient creation and login options.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Debug panel showing detailed auth status, timing, stall detection, and platform info when debugAuth is enabled.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Error UI component displaying a message with optional Retry and Return-to-Landing buttons.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Guidance panel explaining popup issues during II login with a Retry button and direct II link.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Status banner showing current auth step, timing, outcomes, and suggested actions including retry and II link.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Banner indicating backend warmup state with messages for warming, ready, or failed modes and retry support.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handler for II authorize callbacks that checks onboarding status and redirects accordingly.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Wrapper loading II config before instantiating InternetIdentityProvider for safe environment setup.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/RootLayout.tsx": "Root layout wrapping all pages with onboarding context and II callback handler.",
  "frontend/src/components/TaskModal.tsx": "Task timer modal with start/pause/resume logic and completion handling.",
  "frontend/src/config/ai.ts": "Deprecated AI config returning static values and warning to use proxy instead.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "React context storing onboarding answers and AI-generated results with provider and hook.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing an authenticated or anonymous backend actor and refreshing dependent queries.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Hook managing auth attempt lifecycle with flags, timestamps, correlation IDs, and reset helpers.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Tracks auth flow steps, timing, and outcomes with logging and slow‑step detection for diagnostics.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Manages a warmup process for a canister actor with timeout handling, retry logic, and concurrency guards.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity restoration, and status tracking using AuthClient.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Implements mobile‑safe II login with pre‑initialized AuthClient and structured result handling for popup and cancellation errors.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Patched mobile II login hook using shared configuration and structured outcome handling with pre‑initialized AuthClient.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Provides username/password‑based identity context with storage persistence, restoration, and lifecycle management.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "React hook that manages phase-based post-authentication timeouts, tracks elapsed time, and triggers a callback on timeout.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Hook that detects stalled authentication steps by tracking elapsed time and comparing it against per-step thresholds.",
  "frontend/src/index.css": "Global Tailwind-based styles defining the app’s color tokens, typography, and dark theme using a chocolate-inspired palette.",
  "frontend/src/lib/aiClient.ts": "Legacy AI client that is disabled and throws an error if used.",
  "frontend/src/lib/aiProxyClient.ts": "Proxy client for calling external AI endpoints with validation, typed responses, and error handling.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Empty placeholder module for onboarding-related logic.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, and wraps the app with the InternetIdentityProvider.",
  "frontend/src/pages/Daily.tsx": "Daily steps page that loads AI-generated tasks, shows loading and error states, and displays selectable tasks with a modal.",
  "frontend/src/pages/Fridge.tsx": "Fridge page showing hardcoded chocolate inventory with period toggles and simple UI cards.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, feature carousel modal, and navigation buttons for signup and login.",
  "frontend/src/pages/Login.tsx": "Complex Internet Identity login flow handling validation, timeouts, platform quirks, and redirecting after authentication.",
  "frontend/src/pages/Onboarding.tsx": "Multi‑step onboarding form that validates access, collects goal inputs, generates an AI onboarding plan, and stores results in context.",
  "frontend/src/pages/Signup.tsx": "Signup page implementing Internet Identity authentication with diagnostics, stall detection, and redirect after identity validation.",
  "frontend/src/pages/SignupTest.tsx": "Simplified backup signup page that triggers Internet Identity login and redirects to onboarding when ready.",
  "frontend/src/pages/SweetSummit.tsx": "Displays the AI‑generated onboarding plan, including big goal and first weekly mountain, or redirects if no data exists.",
  "frontend/src/pages/WeeklyMountain.tsx": "Fetches and displays a weekly AI-generated plan, caching results per week and handling loading and error states.",
  "frontend/src/utils/authDiagnostics.ts": "Provides correlated auth logging, step tracking, and diagnostic utilities for authentication flows.",
  "frontend/src/utils/identityValidation.ts": "Validates identities and determines whether a session is stale based on delegation and anonymity checks.",
  "frontend/src/utils/passwordIdentity.ts": "Generates deterministic Ed25519 identities from credentials and provides storage, restoration, and clearing utilities.",
  "frontend/src/utils/platform.ts": "Detects Chrome on Android and caches platform info for safe Internet Identity flows.",
  "frontend/src/utils/safeRender.ts": "Safely converts AI-provided values to strings and extracts validated string fields to prevent rendering errors.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters across both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS themes, colors, typography, and animations with custom extensions and plugins.",
  "project_state.json": "Defines the project’s schema version, current state version, and a detailed list of implemented backend and frontend features. Captures RBAC, onboarding logic, API behaviors, and overall app architecture for build planning."
}