{
  "backend/AltSignup.mo": "Provides a simple signup handler with basic empty-field validation and simulated success response.",
  "backend/main.mo": "Actor manages user profiles with permission checks using AccessControl and stores profiles in a Principal-keyed map.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend project files.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Main HTML entry loading fonts, configuring II_URL, and bootstrapping the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Specifies allowed Internet Identity alternative origins.",
  "frontend/public/404.html": "Fallback page that redirects unknown routes to index.html for SPA routing.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for signup, login, onboarding, and feature pages.",
  "frontend/src/auth/iiConfig.ts": "Provides shared configuration helpers for creating and logging in AuthClient instances using Internet Identity.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Debug panel displaying Internet Identity auth state, timing, platform info, and stall detection.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Reusable error UI component with message display and optional retry or navigation actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Inline help panel guiding users when the Internet Identity popup is blocked, offering retry and a direct II link.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Persistent auth status banner showing step progress, timing, outcomes, and retry/direct II actions.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Displays backend warmup status with warming, ready, and failure states plus retry support.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handles II authorize callbacks and redirects users based on onboarding completion.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Fetches dynamic II config and wraps children with a configured InternetIdentityProvider.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/RootLayout.tsx": "Wraps app routes with onboarding context and II authorization callback handler.",
  "frontend/src/components/TaskModal.tsx": "Modal with timer controls for completing a task, including countdown, pause, resume, and confirmation prompts.",
  "frontend/src/config/ai.ts": "Deprecated AI config stub returning empty defaults and warning to use the proxy instead.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Context for storing, persisting, and clearing onboarding results using localStorage with hydration safety.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the II identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Manages a guarded auth-attempt lifecycle with timestamps, correlation IDs, and reset capability.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Tracks detailed auth-flow steps, timings, slow-step detection, and terminal outcomes with correlation IDs.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Provides a warmup hook that immediately marks the canister as ready and supports optional auto-start and manual retry.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines context and provider for Internet Identity authentication, handling identity restoration, login flow, and status tracking.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Implements mobile‑safe Internet Identity login with pre-initialized AuthClient and detailed outcome handling.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Mobile II login hook using shared config for AuthClient initialization and consistent login behavior.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Manages username/password-based identity with storage, restoration, and provider-based access.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Runs timeout tracking for post-auth phases and exposes timeout state, elapsed time, and reset logic.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalls in the auth pipeline using step-based timeouts and reports stall state, timing, and reason.",
  "frontend/src/index.css": "Defines global Tailwind layers and a custom chocolate-themed OKLCH color system with typography and utility overrides.",
  "frontend/src/lib/aiClient.ts": "Legacy AI client stub that throws an error and should not be used.",
  "frontend/src/lib/aiProxyClient.ts": "Implements the AI proxy client with request/response types, validation, error handling, and helpers for calling external AI endpoints.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides storage key plus safe JSON parse and stringify helpers for persisted onboarding data.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Daily.tsx": "Displays daily tasks generated by the AI proxy, handling loading, errors, and task modal interactions.",
  "frontend/src/pages/Fridge.tsx": "Shows hardcoded chocolate inventory by period with UI controls to switch views.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero section, feature carousel modal, and navigation buttons for signup/login.",
  "frontend/src/pages/Login.tsx": "Implements a complex Internet Identity login flow with validation, timeouts, diagnostics, stalled-state detection, and mobile-patched login handling.",
  "frontend/src/pages/Onboarding.tsx": "Guides authenticated users through a multi-step onboarding form, calls an AI API to generate a plan, and stores the result in context.",
  "frontend/src/pages/Signup.tsx": "Handles the signup authentication flow using Internet Identity with validation, diagnostics, timeouts, and mobile-friendly login logic.",
  "frontend/src/pages/SignupTest.tsx": "Provides a simplified backup signup page that triggers Internet Identity login and redirects to onboarding when authenticated.",
  "frontend/src/pages/SweetSummit.tsx": "Displays the user's generated onboarding plan and allows navigating back to onboarding if missing.",
  "frontend/src/pages/WeeklyMountain.tsx": "Generates or loads a weekly mountain plan based on onboarding data, caches it per week, and handles errors and onboarding resets.",
  "frontend/src/utils/authDiagnostics.ts": "Provides types and helpers for tracking auth steps, generating correlation IDs, and logging step transitions, outcomes, and warnings.",
  "frontend/src/utils/identityValidation.ts": "Validates identities by checking anonymity and delegation validity and determines whether a session is stale.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from credentials and provides functions to store, restore, and clear them from localStorage.",
  "frontend/src/utils/platform.ts": "Detects Chrome on Android and caches platform info for mobile-specific auth logic.",
  "frontend/src/utils/safeRender.ts": "Converts unknown values into safe strings for React rendering and offers fallback and string‑extraction utilities.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter parsing, session persistence, and safe removal of parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes current project state and requirements, emphasizing a fresh Internet Identity login flow with onboarding routing."
}