{
  "backend/AltSignup.mo": "Simple signup handler performing empty-field validation and returning a simulated success response.",
  "backend/main.mo": "Actor managing user profiles with permission-checked create, read, and delete operations using AccessControl.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Empty stylesheet placeholder with no content.",
  "frontend/index.html": "HTML entry point setting up fonts, II_URL environment config, and mounting the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Declares permitted alternative origins for Internet Identity.",
  "frontend/public/404.html": "SPA redirect page sending unknown routes to index.html for client-side routing.",
  "frontend/src/App.tsx": "Configures the TanStack Router with RootLayout and routes for auth, onboarding, and feature pages.",
  "frontend/src/auth/iiConfig.ts": "Provides shared Internet Identity client and login configuration using dynamic env-based II URLs.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Debug-only panel showing detailed auth state, timing, platform info, and stall detection.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Shows an error message with optional Retry and Return-to-Landing actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Displays popup-blocking guidance with a Retry button and direct Internet Identity link.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Persistent banner showing current auth step, timing, outcomes, and suggested actions.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Banner indicating backend warmup progress with warming, ready, and failure states.",
  "frontend/src/components/auth/DisplayNamePromptDialog.tsx": "Dialog prompting the user to enter and save a display name or skip.",
  "frontend/src/components/auth/IdentityConfirmationCard.tsx": "Card showing display name and principal with options to continue or switch identity.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handles II authorize callbacks and routes based on onboarding status and session-initiation flags.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Wraps InternetIdentityProvider and loads dynamic II createOptions before rendering.",
  "frontend/src/components/auth/PostAuthDisplayNameGate.tsx": "Deprecated component that renders nothing.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty file with no implementation.",
  "frontend/src/components/AuthenticatedHeader.tsx": "Header component with logout and delete-account actions that clear identity, caches, and local state.",
  "frontend/src/components/RootLayout.tsx": "Wraps all routes with onboarding context and II authorization callback handling.",
  "frontend/src/components/TaskModal.tsx": "Task timer modal supporting start, pause, resume, cancel, and completion with internal countdown state.",
  "frontend/src/config/ai.ts": "Legacy unused AI config file returning a deprecated placeholder config.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Context for storing onboarding answers and AI responses with localStorage hydration and persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Manages user-initiated auth attempts with timestamps, correlation IDs, and sessionStorage flags.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Tracks auth flow state, timing, step transitions, and slow-step detection for diagnostics.",
  "frontend/src/hooks/useAuthPageAutoredirect.ts": "Auto-redirects authenticated users from login/signup to onboarding or main app based on profile data.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Stub warmup hook marking readiness immediately since backend no longer requires warmup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth client, login/clear functions, and identity state via React context.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useLocalDisplayName.ts": "Handles per-principal display names and skip flags using localStorage.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Provides a mobile-safe Internet Identity login hook with pre-initialized AuthClient and structured login result handling.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "A patched variant of the mobile II login hook that uses shared configuration options for AuthClient and login.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Manages a password-based identity via context, including creation, persistence, restoration, and clearing.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Implements timeout tracking for post-auth phases, exposing elapsed time, timeout state, and a reset function.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching, saving, and deleting the caller's user profile via the backend actor.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Detects stalled authentication steps using step-specific timeouts and reports stall state and diagnostics.",
  "frontend/src/index.css": "Defines global Tailwind styles and a chocolate-themed OKLCH color palette for the application.",
  "frontend/src/lib/aiClient.ts": "Legacy AI client placeholder that throws an error and should not be used.",
  "frontend/src/lib/aiProxyClient.ts": "Defines AI proxy request/response types, validation helpers, and error handling for calling backend AI endpoints.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides localStorage key and safe JSON parse/stringify helpers for onboarding data.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Daily.tsx": "Fetches and displays daily tasks based on onboarding data, handling loading, errors, and a task detail modal.",
  "frontend/src/pages/Fridge.tsx": "Shows hardcoded chocolate inventory stats with a period selector UI.",
  "frontend/src/pages/Landing.tsx": "Renders the marketing landing page with feature slides, hero section, and signup/login actions.",
  "frontend/src/pages/Login.tsx": "Implements a complex Internet Identity login flow with validation, diagnostics, error handling, and redirects.",
  "frontend/src/pages/Onboarding.tsx": "Manages the multi-step onboarding flow, collects user inputs, triggers AI plan generation, and redirects authenticated or pre-onboarded users.",
  "frontend/src/pages/Signup.tsx": "Implements a complex Internet Identity signup flow with diagnostics, stalled-auth detection, and auto-redirect for authenticated users.",
  "frontend/src/pages/SignupTest.tsx": "Provides a simplified backup signup page using Internet Identity and redirects to onboarding after authentication.",
  "frontend/src/pages/SweetSummit.tsx": "Displays the user’s generated onboarding plan and redirects to onboarding if no plan data exists.",
  "frontend/src/pages/WeeklyMountain.tsx": "Generates or loads the weekly mountain plan based on onboarding results, caching by week and handling errors and reloads.",
  "frontend/src/utils/authDiagnostics.ts": "Utility for detailed auth-flow diagnostics including step logging, timing, correlation IDs, and slow-step warnings.",
  "frontend/src/utils/identityValidation.ts": "Provides helpers to validate identities by checking anonymity and delegation validity, and flags sessions as stale when identities become invalid.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from username/password pairs and handles storing, restoring, and clearing them in localStorage.",
  "frontend/src/utils/platform.ts": "Detects whether the user is on Chrome Android and caches platform info for performance.",
  "frontend/src/utils/safeRender.ts": "Safely converts unknown AI-provided values into displayable strings and offers helpers for safe string extraction and fallback handling.",
  "frontend/src/utils/sessionReset.ts": "Clears all SweetSteps-related client-side state from localStorage for logout or account deletion.",
  "frontend/src/utils/urlParams.ts": "Parses URL and hash parameters, persists them in sessionStorage, and provides utilities to retrieve, store, and clear them.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins like typography, container queries, and animations.",
  "project_state.json": "Defines the project's current state, including onboarding flow requirements, known issues, and pending feature requests related to display‑name and post‑auth logic."
}