{
  "kind": "build_request",
  "title": "Fix double Internet Identity invocation and false “Waiting for authentication” error on Signup",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Signup Internet Identity flow so that after a successful Internet Identity authentication (including the case where the user returns already authenticated), the Signup page immediately proceeds to post-auth handling and routes to /onboarding without showing the “Waiting for authentication…” / popup-blocked error and without requiring the user to press Retry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yess correct. please fix it now"
        ]
      },
      "acceptanceCriteria": [
        "From a fresh browser session (or after clearing II session), clicking “Sign up with Internet Identity” and completing authentication returns to the app and automatically navigates to /onboarding without showing the popup-blocked help/error state.",
        "If Internet Identity returns immediately because the user is already authenticated, the Signup page treats this as a successful auth state and continues to /onboarding (no blocking error UI, no second II call required).",
        "The Signup page does not require a second user action (Retry) to complete routing to /onboarding once the user is authenticated.",
        "The auth status UI does not remain stuck in “Waiting for authentication…” for an authenticated user."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Signup page’s attempt-state/guards so that successful authentication is detected even if the component remounts or local state/refs reset (e.g., after returning from Internet Identity). Use the existing sessionStorage user-initiated-auth marker (sweetsteps_user_initiated_auth) and the presence of a valid iiIdentity to resume the flow and complete validation/navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "basically it clls II TWICE. get wt im saying?"
        ]
      },
      "acceptanceCriteria": [
        "If the user initiated auth (sweetsteps_user_initiated_auth is set) and a valid Internet Identity is present on page load/return, the Signup page transitions into the validating/redirecting phases automatically and navigates to /onboarding.",
        "The fix does not introduce automatic redirects for users who did not click Sign up during the current visit (i.e., do not redirect solely because an identity is restored unless the existing user-initiated marker indicates an active attempt)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust the Retry behavior on the Signup page so that it does not unnecessarily trigger a second Internet Identity login when the user is already authenticated; instead, it should recover by completing the post-auth flow (validation + navigation) using the existing authenticated identity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "n when i click on that \"retry\" btn, it takes me to onboarding. basically it clls II TWICE."
        ]
      },
      "acceptanceCriteria": [
        "When the user is already authenticated, pressing Retry does not open Internet Identity again and instead immediately proceeds toward /onboarding.",
        "Retry remains functional for genuinely blocked/failed popups (it can still re-attempt login when there is no authenticated identity available)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Keep the Login page behavior consistent with the fixed Signup semantics for the “already authenticated” and “return-from-II/remount” scenarios, so Login also does not get stuck in “Waiting for authentication…” or require Retry when an authenticated identity is already available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please fix it now"
        ]
      },
      "acceptanceCriteria": [
        "If the user is already authenticated, clicking “Log in with Internet Identity” does not produce a popup-blocked waiting state; it proceeds to the normal post-auth redirect logic (/weekly-mountain or /onboarding).",
        "If the user returns from Internet Identity and the page remounts, Login resumes the post-auth flow using the existing identity when sweetsteps_user_initiated_auth is present."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or other paths listed in frontend.immutablePaths.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Changing backend canister logic or the user profile/onboarding schema.",
    "Introducing new authentication providers beyond Internet Identity.",
    "Redesigning the overall auth UI beyond what is required to prevent the false error/double-II invocation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}