{
  "kind": "build_request",
  "title": "Match Landing ‘Continue with Internet Identity’ button styling to Weekly Mountain and remove icon inside button",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update ONLY the selected button at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[2]/button[1] (the Landing page “Continue with Internet Identity” button) to use the exact same visual styling as the Weekly Mountain page primary button labeled “View Today's SweetSteps” (same Tailwind class styling for height, typography, rounding, background, hover, and text colors).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-ctx-1",
          "conv-ctx-1"
        ],
        "quotes": [
          "can you please make the styling of this button the exact exact same as the \"view today's daily Steps\" button in the weekly mountain page?",
          "Use the XPath expression to identify the element to edit.\n\nElement 1:\n- XPath:\n/html[1]/body[1]/div[1]/div[1]/main[1]/div[2]/button[1]"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/Landing.tsx, the ‘Continue with Internet Identity’ <Button> uses the same Tailwind class styling as the Weekly Mountain primary button (‘View Today's SweetSteps’) for: height, font size/weight, border radius, background color, hover background color, and text color.",
        "No other elements on the Landing page are modified (no layout, text, routing, logic, or other component changes beyond this one button element)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the mountain icon from inside ONLY the selected button at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[2]/button[1] so the button content renders as text-only (keep the existing button label/behavior unchanged).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "conv-ctx-1"
        ],
        "quotes": [
          "I'm talking about the mountain icon that's inside the button itself"
        ]
      },
      "acceptanceCriteria": [
        "The selected button renders without any Mountain icon (no lucide Mountain component, SVG, emoji, or leading icon element inside the button).",
        "The button label remains in English and remains the existing text (‘Continue with Internet Identity’ / ‘Connecting...’) and the click handler/disabled behavior is unchanged."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY to the selected element identified by XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[2]/button[1].",
    "Do not change any other UI elements, page content, routes, or authentication logic.",
    "Do not edit any files under frontend/src/components/ui (read-only); implement styling changes by adjusting props/classes where the selected button is declared."
  ],
  "nonGoals": [
    "Fixing or changing the Internet Identity authentication flow behavior (redirects, retries, stall handling).",
    "Restyling any other buttons (e.g., ‘Why SweetSteps?’) or removing the hero mountain icon outside the button."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}