{
  "kind": "build_request",
  "title": "Daily SweetSteps: Open TaskModal from task taps + update header and task container styling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Update the Daily SweetSteps page header to display the title \"Today's SweetSteps\" and also display today's date in the header (in English). Remove the current header text \"Daily SweetSteps\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "change the HEADER of the page to \"Today's SweetSteps\" , and also add the date as well please"
        ]
      },
      "acceptanceCriteria": [
        "On /daily, the page header title reads exactly: \"Today's SweetSteps\"",
        "The header also shows today's date (e.g., a readable English format such as \"February 4, 2026\")",
        "The header no longer displays \"Daily SweetSteps\" anywhere"
      ]
    },
    {
      "id": "REQ-6",
      "text": "On the Daily SweetSteps page, remove the in-card heading \"Today's SweetSteps\" from the tasks container card, and remove the border and background color from the card/container that wraps the full tasks list (while keeping each individual task row styling intact).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please remove the border and background color from the card that contains all the tasks",
          "Please remove that as well"
        ]
      },
      "acceptanceCriteria": [
        "The tasks list wrapper no longer has a visible border",
        "The tasks list wrapper no longer has a background fill (appears transparent against the page background)",
        "The in-wrapper heading \"Today's SweetSteps\" is removed",
        "Each task row still renders with its existing row-level styling (border/background/hover) unless explicitly changed by these requirements"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Wire the Daily SweetSteps task list so that clicking/tapping a task opens the existing TaskModal and passes the selected task data into it. The modal must show the selected task title, include a reasonable description derived from the task (if no description exists in the data), and set the modal's initial timer minutes based on the task's time value. Closing the modal returns to the list. Completing the task via the modal should execute the existing onComplete callback flow (and then close).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yup that's exactly what I want."
        ]
      },
      "acceptanceCriteria": [
        "Clicking any task row on /daily opens TaskModal",
        "TaskModal header title matches the clicked task's task text",
        "TaskModal shows a non-empty description for the selected task (derived from the task text if necessary)",
        "TaskModal initial timer minutes reflect the selected task's time (minutes) value",
        "Clicking the close control or backdrop closes TaskModal and returns to the list",
        "Selecting \"Yes\" after the timer finishes triggers the modal onComplete flow and closes the modal"
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not edit files listed as immutable: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not add backend persistence or new backend APIs for tasks or completion rewards as part of this change.",
    "Do not change authentication/onboarding flows as part of this change.",
    "Do not redesign the individual task row UI beyond what is required to support click-to-open behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}