{
  "kind": "build_request",
  "title": "Fix auth card layout overflow and move account actions into a hamburger menu",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Adjust the identity confirmation card so its content is never cut off: make the card height fully auto (no implicit/explicit fixed height constraints), reduce internal padding slightly where needed, and ensure long text (e.g., principal) wraps without overflowing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Bro can you please increase the height of this card, as it is cutting off some text. Feel free to reduce its padding a little.",
          "2. Yes"
        ]
      },
      "acceptanceCriteria": [
        "On small screens, all card text is fully visible without being clipped.",
        "The card uses content-driven (auto) height rather than a fixed height that can truncate text.",
        "Padding is slightly reduced compared to current styling while maintaining readability.",
        "Long principal strings still wrap (break-all) and do not cause horizontal overflow."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reduce the padding of the parent container that wraps the affected card to eliminate overflow, with a significant reduction primarily on top/bottom while preserving reasonable left/right padding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ],
        "quotes": [
          "And also, it's parent container has too much padding, which is causing overflow.",
          "Mainly top/bottom"
        ]
      },
      "acceptanceCriteria": [
        "The page containing the affected card no longer overflows vertically due to excessive top/bottom padding.",
        "Top/bottom padding is significantly tighter than before; left/right padding remains comfortable.",
        "No horizontal scrollbar is introduced by the container spacing changes."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the header’s direct Logout and Delete Account buttons with a small hamburger menu in AuthenticatedHeader that contains actions for Logout and Delete Account; keep the existing delete confirmation dialog and preserve current disabled/loading/error behavior for both actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "Also, can you please add a little hamburger nav that contains the logout and delete account options instead of them being directly in the header?",
          "Yes I want you to apply all the specified changes, even though i have selected only the card."
        ]
      },
      "acceptanceCriteria": [
        "AuthenticatedHeader no longer shows Logout/Delete buttons directly in the header layout; instead, a hamburger trigger opens a menu containing both actions.",
        "Clicking Logout from the menu performs the same logout flow as before (identity cleared, React Query cache cleared, onboarding/session cleared, navigates to '/').",
        "Clicking Delete Account from the menu opens the existing confirmation dialog and, upon confirmation, performs the same deletion flow as before (calls deleteCallerUserData, clears session/caches, navigates to '/').",
        "While an action is in progress, the menu actions are disabled appropriately and loading state is still communicated to the user.",
        "Any existing delete error message handling continues to work and remains visible when relevant."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Respect existing single-backend-actor architecture; no backend changes are required for these UI/layout updates."
  ],
  "nonGoals": [
    "Adding new account actions beyond Logout and Delete Account.",
    "Changing backend deleteCallerUserData behavior or data model.",
    "Reworking overall app navigation or authentication logic beyond the requested layout/menu changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}