{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Post-auth pre-onboarding display-name gate and remove modal close control",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show the display-name prompt only for authenticated new users (no backend profile) immediately before onboarding starts, and never for anonymous or onboarded users.",
      "acceptanceCriteria": [
        "After a successful authentication, if the caller does not yet have a backend profile (onboarding incomplete) and they have no local display name and have not skipped, the display-name prompt is shown before the onboarding UI is accessible.",
        "If the caller already has a backend profile (onboarding complete), the display-name prompt is not shown as part of navigation/redirect to the post-onboarding destination.",
        "The onboarding page’s first step (the goal question) is not shown until the display-name prompt has been completed (Save) or dismissed via the existing Skip action.",
        "The display-name prompt does not appear for anonymous identities."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RootLayout.tsx",
          "operation": "modify",
          "description": "Remove the global PostAuthDisplayNameGate mounting so the display-name prompt is no longer shown outside the new-user pre-onboarding flow. (This prevents the prompt from appearing for already-onboarded users on post-onboarding pages.)"
        },
        {
          "path": "frontend/src/pages/Onboarding.tsx",
          "operation": "modify",
          "description": "Implement a pre-onboarding gate that checks: authenticated non-anonymous identity, backend profile is null (using getCallerUserProfile from the authorization system), and local display-name state (no saved name and not skipped). When gate conditions are met, render the existing DisplayNamePromptDialog and block rendering/interaction of onboarding step 1 until Save or Skip is taken. Use the existing localStorage helpers (useLocalDisplayName). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/PostAuthDisplayNameGate.tsx",
          "operation": "modify",
          "description": "Deprecate or narrow this component so it no longer triggers the display-name prompt globally (e.g., convert to a no-op wrapper or add route/profile gating if it must remain for compatibility). Ensure it will not show the prompt for onboarded users. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update post-auth redirect logic so new authenticated users reach onboarding in a way that triggers the pre-onboarding display-name gate first (callback handler and auth-page auto-redirect), without loops.",
      "acceptanceCriteria": [
        "Flows that currently navigate new authenticated users to /onboarding (e.g., callback-handling and auth-page auto-redirect) instead trigger the display-name step first when the display-name gate conditions are met.",
        "If the user already has a display name saved (or has skipped for that principal), the app proceeds directly to onboarding without showing the prompt.",
        "No redirect loops occur (e.g., repeatedly re-triggering the display-name step)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx",
          "operation": "modify",
          "description": "Adjust the post-auth navigation decision for new users so that when it routes to onboarding, it reliably results in the pre-onboarding display-name gate being evaluated first (before onboarding questions can render). Keep the existing behavior for onboarded users (weekly-mountain and Sweet Summit handling). Ensure no repeated navigation occurs after the first handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAuthPageAutoredirect.ts",
          "operation": "modify",
          "description": "Update the auto-redirect behavior for authenticated users on /login and /signup so that the new-user redirect path ensures the display-name gate will run before onboarding questions (while still sending onboarded users to /weekly-mountain). Preserve the one-time redirect guard to avoid loops. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Align any explicit post-auth navigation to onboarding so it does not bypass the new pre-onboarding display-name gate (e.g., avoid alternative destinations for profile-null users and ensure the onboarding page is the single entry where the gate runs). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Signup.tsx",
          "operation": "modify",
          "description": "Align any explicit post-auth navigation to onboarding so it does not bypass the new pre-onboarding display-name gate, while keeping existing signup flow behavior and avoiding redirect loops. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove the visible close (X) control from the display-name modal without changing any other behavior.",
      "acceptanceCriteria": [
        "The display-name modal no longer renders a visible close (X) control.",
        "The modal remains non-dismissable via clicking outside (as it is now), and still supports only the existing Save and Skip actions for dismissal/progression.",
        "No other text, layout, or button behavior in the display-name modal changes aside from removing the X control."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/DisplayNamePromptDialog.tsx",
          "operation": "modify",
          "description": "Remove the non-functional close (X) control from the rendered dialog by adjusting only this component (without modifying any files under frontend/src/components/ui). Keep outside-click prevention, onOpenChange no-op, validation, Save, and Skip behavior unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}