{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Daily SweetSteps: header/date update, task container styling, and TaskModal open-on-tap",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Update /daily header title to \"Today's SweetSteps\" and display today's date in English; remove \"Daily SweetSteps\" header text.",
      "acceptanceCriteria": [
        "On /daily, the page header title reads exactly: \"Today's SweetSteps\"",
        "The header also shows today's date (e.g., a readable English format such as \"February 4, 2026\")",
        "The header no longer displays \"Daily SweetSteps\" anywhere"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Daily.tsx",
          "operation": "modify",
          "description": "Replace the header h1 text with exactly \"Today's SweetSteps\" and add a date line derived at render time using an English locale date format; ensure the old \"Daily SweetSteps\" header text is removed from the page."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Remove the in-card heading from the tasks container and make the tasks list wrapper transparent (no border/background) while keeping per-row styling intact.",
      "acceptanceCriteria": [
        "The tasks list wrapper no longer has a visible border",
        "The tasks list wrapper no longer has a background fill (appears transparent against the page background)",
        "The in-wrapper heading \"Today's SweetSteps\" is removed",
        "Each task row still renders with its existing row-level styling (border/background/hover) unless explicitly changed by these requirements"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Daily.tsx",
          "operation": "modify",
          "description": "Remove the CardHeader/CardTitle section currently rendering \"Today's SweetSteps\" inside the tasks container and adjust the tasks list wrapper styling so it has no border and no background (transparent), without changing the existing task row-level classes."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Open TaskModal when a task row is clicked and pass selected task data (title, derived description, initial minutes) into the modal; ensure close and completion behaviors match existing modal flow.",
      "acceptanceCriteria": [
        "Clicking any task row on /daily opens TaskModal",
        "TaskModal header title matches the clicked task's task text",
        "TaskModal shows a non-empty description for the selected task (derived from the task text if necessary)",
        "TaskModal initial timer minutes reflect the selected task's time (minutes) value",
        "Clicking the close control or backdrop closes TaskModal and returns to the list",
        "Selecting \"Yes\" after the timer finishes triggers the modal onComplete flow and closes the modal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Daily.tsx",
          "operation": "modify",
          "description": "Wire task-row click/tap to set a selected-task state and open the existing frontend/src/components/TaskModal.tsx. Pass the clicked task text as the modal title, derive a non-empty description from the task text when no description exists in data, and pass the task time value as the modal’s estimated minutes. Provide an onClose handler that returns to the list and an onComplete handler that executes the current completion flow for Daily (no new persistence) and then closes the modal."
        }
      ]
    }
  ]
}