{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Match Landing Internet Identity button styling to Weekly Mountain primary button and remove inner icon",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the Landing page “Continue with Internet Identity” button to exactly match the Weekly Mountain primary button Tailwind styling.",
      "acceptanceCriteria": [
        "In frontend/src/pages/Landing.tsx, the ‘Continue with Internet Identity’ <Button> uses the same Tailwind class styling as the Weekly Mountain primary button (‘View Today's SweetSteps’) for: height, font size/weight, border radius, background color, hover background color, and text color.",
        "No other elements on the Landing page are modified (no layout, text, routing, logic, or other component changes beyond this one button element)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Landing.tsx",
          "operation": "modify",
          "description": "Modify ONLY the <Button> at /html[1]/body[1]/div[1]/div[1]/main[1]/div[2]/button[1] (Landing “Continue with Internet Identity”) to use the exact same Tailwind class styling as the Weekly Mountain primary button (“View Today's SweetSteps”): apply the same height/typography/rounding/background/hover/text color classes (e.g., match the WeeklyMountain button’s h-14 text-base font-semibold rounded-xl bg-primary hover:bg-primary/90 text-primary-foreground). Keep all other Landing elements unchanged. Use the existing shadcn-ui <Button> component for styling via props/classes only; do not modify any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the Landing “Continue with Internet Identity” button renders text-only by removing any mountain icon inside the button.",
      "acceptanceCriteria": [
        "The selected button renders without any Mountain icon (no lucide Mountain component, SVG, emoji, or leading icon element inside the button).",
        "The button label remains in English and remains the existing text (‘Continue with Internet Identity’ / ‘Connecting...’) and the click handler/disabled behavior is unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Landing.tsx",
          "operation": "modify",
          "description": "Modify ONLY the same selected Landing button element (XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[2]/button[1]) so its children render as text-only: remove any icon/leading element inside the button (e.g., any lucide Mountain usage or SVG) while preserving the existing label text toggling ('Continue with Internet Identity' / 'Connecting...') and the current onClick/disabled behavior. Use the existing shadcn-ui <Button> component; do not edit frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}