{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auth UI layout fixes and account actions hamburger menu",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make IdentityConfirmationCard content-driven (auto height), slightly tighter padding, and ensure principal text wraps without overflow.",
      "acceptanceCriteria": [
        "On small screens, all card text is fully visible without being clipped.",
        "The card uses content-driven (auto) height rather than a fixed height that can truncate text.",
        "Padding is slightly reduced compared to current styling while maintaining readability.",
        "Long principal strings still wrap (break-all) and do not cause horizontal overflow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/IdentityConfirmationCard.tsx",
          "operation": "modify",
          "description": "Remove any implicit truncation of the principal display so the full principal can render; ensure the card/container uses auto height (no fixed/min heights that could clip), reduce internal padding slightly (e.g., CardContent and the inner principal/details panel), and keep/strengthen wrapping/overflow-safe text behavior (e.g., break-all + no horizontal overflow). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Reduce top/bottom padding on the auth page container wrapping the identity confirmation card to prevent overflow while keeping comfortable left/right padding.",
      "acceptanceCriteria": [
        "The page containing the affected card no longer overflows vertically due to excessive top/bottom padding.",
        "Top/bottom padding is significantly tighter than before; left/right padding remains comfortable.",
        "No horizontal scrollbar is introduced by the container spacing changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "modify",
          "description": "Adjust the main page layout container that wraps the auth card/flow to significantly reduce vertical (top/bottom) padding on small screens while preserving reasonable horizontal padding; ensure the layout no longer causes vertical overflow/clipping. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Signup.tsx",
          "operation": "modify",
          "description": "Apply the same container padding reduction strategy as Login for the signup auth flow container so top/bottom padding does not cause overflow on small screens, while keeping left/right padding comfortable. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace AuthenticatedHeader’s direct Logout/Delete buttons with a hamburger-triggered menu that preserves existing logout/delete flows, confirmation dialog, and loading/disabled/error behaviors.",
      "acceptanceCriteria": [
        "AuthenticatedHeader no longer shows Logout/Delete buttons directly in the header layout; instead, a hamburger trigger opens a menu containing both actions.",
        "Clicking Logout from the menu performs the same logout flow as before (identity cleared, React Query cache cleared, onboarding/session cleared, navigates to '/').",
        "Clicking Delete Account from the menu opens the existing confirmation dialog and, upon confirmation, performs the same deletion flow as before (calls deleteCallerUserData, clears session/caches, navigates to '/').",
        "While an action is in progress, the menu actions are disabled appropriately and loading state is still communicated to the user.",
        "Any existing delete error message handling continues to work and remains visible when relevant."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccountActionsMenu.tsx",
          "operation": "create",
          "description": "Create a small hamburger-triggered actions menu (compose shadcn-ui/Radix dropdown-style primitives outside of frontend/src/components/ui) that exposes Logout and Delete Account actions, supports disabled states while logging out/deleting, and can render loading indicators for actions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AuthenticatedHeader.tsx",
          "operation": "modify",
          "description": "Replace the inline Logout and Delete Account buttons with the new hamburger AccountActionsMenu; wire existing handleLogout and delete-account confirmation dialog to be launched from the menu, preserving current loading/disabled states and existing delete error rendering. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}